validation/polydisperseBubbleFoam/Diaz/Diaz_1_2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    boxToCell
    {
        box (-0.5 0 0) (0.5 0.45 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air       0
            volScalarFieldValue moment.0.air    0
            volScalarFieldValue moment.1.air    0
            volScalarFieldValue moment.2.air    0
            volScalarFieldValue moment.3.air    0
            volScalarFieldValue moment.4.air    0
            volScalarFieldValue moment.5.air    0
        );
    }
);


// ************************************************************************* //
